In [ ]:
!pip install selenium

In [1]:
import selenium                                  

from selenium import webdriver                   

import pandas as pd                              

from selenium.webdriver.common.by import By      

import warnings                                  

warnings.filterwarnings("ignore")

import time

# 1

In [ ]:
driver = webdriver.Chrome()

driver.get("https://www.naukri.com/")

In [ ]:
designation=driver.find_element(By.CLASS_NAME,"suggestor-input")
designation.send_keys('Data Analyst')

In [ ]:
location=driver.find_element(By.XPATH,"/html/body/div[1]/div[7]/div/div/div[5]/div/div/div/div[1]/div/input")
location.send_keys('Bangalore')

In [ ]:
search=driver.find_element(By.CLASS_NAME,'qsbSubmit')
search.click()

In [7]:
job_title = []
job_location = []
company_name = []
experience_required = []

In [8]:
#Scraping job title from the given page
title = driver.find_elements(By.XPATH,'//a[@class="title ellipsis"]')
for t in title[0:10]:
    titles=t.text
    job_title.append(titles)

In [10]:
#Scraping job location from the given page
locations = driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft locWdth"]')
for l in locations[0:10]:
    locations=l.text
    job_location.append(locations)

In [11]:
#Scraping job Company name from the given page    
companies = driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for c in companies[0:10]:
    companies=c.text
    company_name.append(companies)

In [12]:
#Scraping job experience required from the given page 
experience = driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft expwdth"]')
for e in experience[0:10]:
    experience=e.text
    experience_required.append(experience)

In [17]:
print(len(job_title),len(job_location),len(company_name),len(experience_required))

10 10 10 10

In [18]:
df=pd.DataFrame({'Title':job_title,'Location':job_location,'Company':company_name,'Experience':experience_required})

In [19]:
df

,Title,Location,Company,Experience
0,Data Analyst,Bangalore/Bengaluru,Eastvantage,4-6 Yrs
1,Data Analyst,"Bangalore/ Bengaluru, Karnataka, Gurgaon/ Guru...",Delhivery,1-3 Yrs
2,Data Analyst,Bangalore/Bengaluru,Everest Vacuum,2-5 Yrs
3,Data Analyst,"Bangalore/Bengaluru, Kolkata, Mumbai, New Delh...",Volvo Financial Services,3-5 Yrs
4,Data Analyst,"Bangalore/Bengaluru, Hyderabad/Secunderabad, Pune",Synechron,5-8 Yrs
5,Data Analyst,"Bangalore/Bengaluru, Hyderabad/Secunderabad, Pune",Synchron Infotech,5-8 Yrs
6,Data Analyst,"Bangalore/Bengaluru, Kolkata, Mumbai, New Delh...",Volvo Financial Services,2-4 Yrs
7,Data Analyst,Bangalore/Bengaluru,ANZ,1-5 Yrs
8,Data Analyst I,Bangalore/Bengaluru,Cerner,5-10 Yrs
9,Data Analyst,Bangalore/Bengaluru,Persolkelly India,0-2 Yrs

# 2

In [36]:
driver = webdriver.Chrome()

driver.get("https://www.naukri.com/")

In [37]:
designations=driver.find_element(By.CLASS_NAME,"suggestor-input")
designations.send_keys('Data Scientist')

In [38]:
locations=driver.find_element(By.XPATH,"/html/body/div[1]/div[7]/div/div/div[5]/div/div/div/div[1]/div/input")
locations.send_keys('Bangalore')

In [39]:
search=driver.find_element(By.CLASS_NAME,'qsbSubmit')
search.click()

In [40]:
jobs = []
location = []
company = []
experiences= []

In [41]:
jobs_tag = driver.find_elements(By.XPATH,'//a[@class="title ellipsis"]')
for i in jobs_tag[0:10]:
    job=i.text
    jobs.append(job)
    
locations_tag = driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft locWdth"]')
for a in locations_tag[0:10]:
    loc=a.text
    location.append(loc)
    
companies_tag = driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for x in companies_tag[0:10]:
    comp=x.text
    company.append(comp)
    
experience_tag = driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft expwdth"]')
for z in experience_tag[0:10]:
    exp=z.text
    experiences.append(exp)

In [43]:
print(len(jobs),len(location),len(company),len(experiences))

10 10 10 10

In [44]:
df1=pd.DataFrame({'Title':jobs,'Location':location,'Company':company,'Experience':experiences})

In [45]:
df1

,Title,Location,Company,Experience
0,Data Science Specialist,"Bangalore/Bengaluru, Kolkata, Mumbai, Hyderaba...",Accenture,2-4 Yrs
1,Data Scientist,"Bangalore/Bengaluru, Mumbai (All Areas)",PwC,3-6 Yrs
2,Analystics & Modeling Specialist,"Bangalore/Bengaluru, Kolkata, Mumbai, Hyderaba...",Accenture,6-8 Yrs
3,"Data Scientist -ML, DL, Python",Bangalore/Bengaluru,Capco,2-6 Yrs
4,DATA SCIENTIST,Bangalore/Bengaluru,Walmart,4-8 Yrs
5,Data Scientist,"Hybrid - Bangalore/ Bengaluru, Karnataka, Noid...",HCLTech,7-12 Yrs
6,Data Scientist with Retail Domain,"Bangalore/Bengaluru, Kolkata, Mumbai, Nagpur, ...",TRH Consultancy Services,4-9 Yrs
7,Data Scientist,"Bangalore/Bengaluru, Noida, Kolkata, Mumbai, H...",TRH Consultancy Services,5-10 Yrs
8,Data Scientist,"Bangalore/Bengaluru, Noida, Kolkata, Mumbai, H...",TRH Consultancy Services,5-10 Yrs
9,Data Scientist,"Bangalore/Bengaluru, Noida, Kolkata, Mumbai, H...",TRH Consultancy Services,5-10 Yrs

# 3

In [54]:
driver = webdriver.Chrome()

driver.get("https://www.naukri.com/")

In [55]:
designations=driver.find_element(By.CLASS_NAME,"suggestor-input")
designations.send_keys('Data Scientist')

In [56]:
search=driver.find_element(By.CLASS_NAME,'qsbSubmit')
search.click()

In [64]:
job_title = []
job_location = []
company_name = []
experience_required = []

In [65]:
tit = driver.find_elements(By.XPATH,'//a[@class="title ellipsis"]')
for i in tit[0:10]:
    job=i.text
    job_title.append(job) 

loc = driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft locWdth"]')
for a in loc[0:10]:
    location=a.text
    job_location.append(location)
    
comp = driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for x in comp[0:10]:
    company=x.text
    company_name.append(company)
    
exp = driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft expwdth"]')
for z in exp[0:10]:
    experience=z.text
    experience_required.append(experience)

In [66]:
print(len(job_title),len(job_location),len(company_name),len(experience_required))

10 10 10 10

In [67]:
df=pd.DataFrame({'Jobs title':job_title,'Jobs location':job_location,'Company name':company_name,'Experience required':experience_required})

In [68]:
df

,Jobs title,Jobs location,Company name,Experience required
0,Analystics & Modeling Specialist,"Kolkata, Mumbai, Hyderabad/Secunderabad, Pune,...",Accenture,6-8 Yrs
1,Data Science Specialist,"Kolkata, Mumbai, Hyderabad/Secunderabad, Pune,...",Accenture,2-4 Yrs
2,Data Scientist,"Bangalore/Bengaluru, Mumbai (All Areas)",PwC,3-6 Yrs
3,Data Scientist,"Hubli, Mangaluru/Mangalore, Mysore/Mysuru, Ban...",Alp Consulting,3-7 Yrs
4,ACN - Applied Intelligence - Finance - Data Sc...,"Hyderabad/Secunderabad, Pune, Chennai, Gurgaon...",Accenture,2-7 Yrs
5,Senior Data Scientist,"Mumbai, Bangalore/Bengaluru",Fractal Analytics,5-10 Yrs
6,Data Scientist,"Hybrid - Noida, Uttar Pradesh, Bangalore/ Beng...",HCLTech,7-12 Yrs
7,Senior Data Scientist (PhD) - Computer Vision,Pune,Vineet Tyre Center,2-7 Yrs
8,Sr . Data Scientist / Manager,"Noida, Gurgaon/Gurugram, Bangalore/Bengaluru",Novitas Infotech,7-10 Yrs
9,Data Scientist,"Noida, Gurgaon/Gurugram, Bangalore/Bengaluru",Novitas Infotech,3-7 Yrs

# 4

In [36]:
driver = webdriver.Chrome()

driver.get("https://www.flipkart.com/")

In [37]:
products=driver.find_element(By.CLASS_NAME,"_3704LK")
products.send_keys('sunglasses')

In [38]:
search=driver.find_element(By.CLASS_NAME,'L0Z3Pu')
search.click()

In [39]:
Brand = []
Product_Descriptions = []
Price = []
Discount = []

In [40]:
start=0
end=3

In [41]:
for page in range(start,end):
    brand=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    for i in brand:
        brand_name=i.text
        Brand.append(brand_name)
    
    next_page=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_page.click()
    time.sleep(3)

In [43]:
for page in range(start,end):
    pro_disc=driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
    for p in pro_disc:
        disc=p.text
        Product_Descriptions.append(disc)
        
    next_page=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_page.click()
    time.sleep(3)

In [46]:
for page in range(start,end):
    Pri=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
    for a in Pri:
        prices=a.text
        Price.append(prices)
        
    next_page=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_page.click()
    time.sleep(3)

In [49]:
for page in range(start,end):
    discount=driver.find_elements(By.XPATH,'//div[@class="_3Ay6Sb"]')
    for x in discount:
        Dis=x.text
        Discount.append(Dis)
        
    next_page=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_page.click()
    time.sleep(3)

In [51]:
df = pd.DataFrame({})

df['Brands']=Brand[0:100]
df['Product_descriptions']=Product_Descriptions[0:100]
df['Prices']=Price[0:100] 
df['Discounts']=Discount[0:100]

In [53]:
df

,Brands,Product_descriptions,Prices,Discounts
0,ROYAL SON,UV Protection Wayfarer Sunglasses (62),â‚¹949,52% off
1,ROYAL SON,"Polarized, UV Protection Round Sunglasses (57)","â‚¹9,578",74% off
2,Fastrack,UV Protection Rectangular Sunglasses (52),â‚¹503,80% off
3,SRPM,"UV Protection, Riding Glasses, Polarized, Grad...",â‚¹194,75% off
4,Elligator,"UV Protection, Polarized Round Sunglasses (47)",â‚¹168,70% off
...,...,...,...,...
95,Cool enter,"Polarized, UV Protection Retro Square Sunglass...",â‚¹194,58% off
96,ROYAL SON,UV Protection Aviator Sunglasses (52),â‚¹648,72% off
97,john jacobs,"UV Protection, Gradient Round, Cat-eye Sunglas...",â‚¹820,26% off
98,MEHJ,"UV Protection, Gradient Butterfly, Shield Sung...",â‚¹499,64% off
99,ROADWAY,"Polarized, UV Protection Retro Square Sunglass...",â‚¹256,47% off

# 5

In [84]:
driver = webdriver.Chrome()

driver.get("https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&market")

In [85]:
Ratings = []
Review_summery = []
Full_reviews = []

In [86]:
start = 0
end = 10

In [87]:
for page in range(start,end):
    rating=driver.find_elements(By.XPATH,'//div[@class="_3LWZlK _1BLPMq"]')
    for i in rating:
        rat=i.text
        Ratings.append(rat)
    
    next_page=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_page.click()
    time.sleep(3)

In [88]:
for page in range(start,end):
    rev=driver.find_elements(By.XPATH,'//p[@class="_2-N8zT"]')
    for r in rev:
        review=r.text
        Review_summery.append(review)
        
    next_page=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_page.click()
    time.sleep(3)

In [89]:
for page in range(start,end):
    full=driver.find_elements(By.XPATH,'//div[@class="t-ZTKy"]')
    for a in full:
        ful_rev=a.text
        Full_reviews.append(ful_rev)
        
    next_page=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_page.click()
    time.sleep(3)

In [95]:
print(len(Ratings),len(Review_summery),len(Full_reviews))

100 100 100

In [96]:
df=pd.DataFrame({'Ratings':Ratings,'Review Summery':Review_summery,'Full Review':Full_reviews})
df

,Ratings,Review Summery,Full Review
0,5,Mind-blowing purchase,Photos super
1,5,Classy product,Camera is awesome\nBest battery backup\nA perf...
2,5,Terrific,Very very good
3,5,Wonderful,This is amazing at all
4,5,Must buy!,Itâ€™s really awesome
...,...,...,...
95,5,Brilliant,Excellent Phone.
96,5,Terrific purchase,Value for money ðŸ–¤ðŸ–¤
97,5,Fabulous!,Itâ€™s very good battery life and display and vi...
98,5,Awesome,I dreamt about this day from a long time.... G...
99,5,Wonderful,Very good

# 6

In [97]:
driver = webdriver.Chrome()

driver.get("https://www.flipkart.com/")

In [98]:
Product=driver.find_element(By.CLASS_NAME,"_3704LK")
Product.send_keys('sneakers')

In [99]:
search=driver.find_element(By.CLASS_NAME,"L0Z3Pu")
search.click()

In [100]:
Brands = []
Product_Description = []
Price = []

In [101]:
for page in range(0,3):
    brand=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    for i in brand:
        bra=i.text
        Brands.append(bra)
        
    next_page=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_page.click()
    time.sleep(3)
    
    
for page in range(0,3):
    pro_disc=driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
    for a in pro_disc:
        disc=a.text
        Product_Description.append(disc)
        
    next_page=driver.find_element(By.XPATH,'//a[@class="IRpwTa"]')
    next_page.click()
    time.sleep(3)
    
for page in range(0,3):
    prices=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
    for z in prices:
        pri=z.text
        Price.append(pri)
        
    next_page=driver.find_element(By.XPATH,'//a[@class="IRpwTa"]')
    next_page.click()
    time.sleep(3)

In [108]:
print(len(Brands[0:100]),len(Product_Description[0:100]),len(Price[0:100]))

100 100 100

In [109]:
df=pd.DataFrame({'Brands':Brands[0:100],'Product Descriptions':Product_Description[0:100],'Price':Price[0:100]})

In [110]:
df

        Brands                               Product Descriptions   Price
0       Labbin                                   Sneakers For Men    â‚¹499
1        BIRDE      Combo Pack of 2 Casual Shoes Sneakers For Men    â‚¹479
2     Magnolia                     STREET ICON M Sneakers For Men  â‚¹1,655
3         aadi                         Hustle V2 Sneakers For Men  â‚¹1,399
4       BRUTON            Casual Sneakrs For Men Sneakers For Men    â‚¹672
..         ...                                                ...     ...
95  Free Kicks  Newton-01 Grey Sports,Casual,Walking,Training,...    â‚¹549
96    ASTEROID  Premium Sports Shoes For Men Pack Of 2 Sneaker...    â‚¹479
97    ASTEROID      Combo Pack of 2 Casual Shoes Sneakers For Men    â‚¹479
98      Kraasa                                   Sneakers For Men    â‚¹494
99      BRUTON  Stylish Casual Sports Shoe Sneakers For Women ...    â‚¹549

[100 rows x 3 columns]

# 7

In [116]:
driver = webdriver.Chrome()

driver.get("https://www.amazon.in/")

In [135]:
Title = []
Ratingss = []
Price = []

In [118]:
title = driver.find_elements(By.XPATH,'//span[@class="a-size-medium a-color-base a-text-normal"]')
for t in title[0:10]:
    titles=t.text
    Title.append(titles)

In [136]:
rating=driver.find_elements(By.XPATH,'//span[@class="a-icon-alt"]')
for r in rating[0:10]:
    rats=r.text
    Ratingss.append(rats)

In [137]:
Ratingss

['', '', '', '', '', '', '', '', '', '']

In [128]:
pricing=driver.find_elements(By.XPATH,'//span[@class="a-price-whole"]')
for p in pricing[0:10]:
    pri=p.text
    Price.append(pri)

In [129]:
Price

['',
 '',
 '',
 '86,420',
 '79,990',
 '62,990',
 '1,04,990',
 '71,490',
 '96,490',
 '89,990',
 '61,990',
 '80,990',
 '92,424']

# 8

In [4]:
driver = webdriver.Chrome()

driver.get("https://www.azquotes.com/")

In [5]:
Quote = []
Author = [] 
Type_Of_Quotes = []

In [ ]:
for page in range(0,10):
    qoute=driver.find_elements(By.XPATH,'//a[@class="title"]')
    for i in qoute:
        Q=i.text
        Quote.append(Q)
        
for page in range(0,10):
    authors=driver.find_elements(By.XPATH,'//div[@class="author"]')
    for a in authors:
        auth=a.text
        Author.append(auth)
        
for page in range(0,10):
    typesOfQuotes=driver.find_elements(By.XPATH,'//div[@class="tags"]')
    for x in typesOfQuotes:
        types=x.text
        Type_Of_Quotes.append(types)

In [18]:
print(len(Quote),len(Author),len(Type_Of_Quotes))

1000 1000 1000

In [19]:
df=pd.DataFrame({'Quotes':Quote,'Authors':Author,'Type Of Quote':Type_Of_Quotes})

In [20]:
df

,Quotes,Authors,Type Of Quote
0,The essence of strategy is choosing what not t...,Amelia Earhart,"Inspirational, Life, Success"
1,One cannot and must not try to erase the past ...,Ludwig von Mises,"Peace, War, Government"
2,Patriotism means to stand by the country. It d...,Elizabeth Cady Stanton,"Life, Strength, Courage"
3,Death is something inevitable. When a man has ...,Benjamin Spock,"Positive, Family, Trust"
4,You have to love a nation that celebrates its ...,Michael Jordan,"Inspirational, Life, Motivational"
...,...,...,...
995,Regret for the things we did can be tempered b...,Sydney J. Harris,"Love, Inspirational, Motivational"
996,America... just a nation of two hundred millio...,Hunter S. Thompson,"Gun, Two, Qualms About"
997,For every disciplined effort there is a multip...,Jim Rohn,"Inspirational, Greatness, Best Effort"
998,"The spiritual journey is individual, highly pe...",Ram Dass,"Spiritual, Truth, Yoga"
999,The mind is not a vessel to be filled but a fi...,Plutarch,"Inspirational, Leadership, Education"